# -*- coding: utf-8 -*-

# 同步于[http://dev.netease.im/docs/product/IM即时通讯/服务端API文档/code状态表]

IM_CODE = {
    200: u'操作成功',
    201: u'客户端版本不对，需升级sdk',
    301: u'被封禁',
    302: u'用户名或密码错误',
    315: u'IP限制',
    403: u'非法操作或没有权限',
    404: u'对象不存在',
    405: u'参数长度过长',
    406: u'对象只读',
    408: u'客户端请求超时',
    413: u'验证失败(短信服务)',
    414: u'参数错误',
    415: u'客户端网络问题',
    416: u'频率控制',
    417: u'重复操作',
    418: u'通道不可用(短信服务)',
    419: u'数量超过上限',
    422: u'账号被禁用',
    431: u'HTTP重复请求',
    500: u'服务器内部错误',
    503: u'服务器繁忙',
    508: u'消息撤回时间超限',
    509: u'无效协议',
    514: u'服务不可用',
    998: u'解包错误',
    999: u'打包错误',

    # 群相关
    801: u'群人数达到上限',
    802: u'没有权限',
    803: u'群不存在',
    804: u'用户不在群',
    805: u'群类型不匹配',
    806: u'创建群数量达到限制',
    807: u'群成员状态错误',
    808: u'申请成功',
    809: u'已经在群内',
    810: u'邀请成功',

    # 音视频、白板通话相关错误码
    9102: u'通道失效',
    9103: u'已经在他端对这个呼叫响应过了',
    11001: u'通话不可达，对方离线状态',

    # 聊天室
    13001: u'IM主连接状态异常',
    13002: u'聊天室状态异常',
    13003: u'账号在黑名单中,不允许进入聊天室',
    13004: u'在禁言列表中,不允许发言',
    13005: u'用户的聊天室昵称、头像或成员扩展字段被反垃圾',

    # 特定业务相关错误码
    10431: u'输入email不是邮箱',
    10432: u'输入mobile不是手机号码',
    10433: u'注册输入的两次密码不相同',
    10434: u'企业不存在',
    10435: u'登陆密码或帐号不对',
    10436: u'app不存在',
    10437: u'email已注册',
    10438: u'手机号已注册',
    10441: u'app名字已经存在',
}
